TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/sysctl.h
//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_lockCPUSelectRegs() as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    //! Configure CPU Select for EPWM
    SYSCTL_CPUSEL0_EPWM      = 0x0U,
    //! Configure CPU Select for ECAP
    SYSCTL_CPUSEL1_ECAP      = 0x1U,
    //! Configure CPU Select for EQEP
    SYSCTL_CPUSEL2_EQEP      = 0x2U,
    //! Configure CPU Select for SD
    SYSCTL_CPUSEL4_SD        = 0x4U,
    //! Configure CPU Select for SCI
    SYSCTL_CPUSEL5_SCI       = 0x5U,
    //! Configure CPU Select for SPI
    SYSCTL_CPUSEL6_SPI       = 0x6U,
    //! Configure CPU Select for I2C
    SYSCTL_CPUSEL7_I2C       = 0x7U,
    //! Configure CPU Select for CAN
    SYSCTL_CPUSEL8_CAN       = 0x8U,
    //! Configure CPU Select for ADC
    SYSCTL_CPUSEL11_ADC      = 0xBU,
    //! Configure CPU Select for CMPSS
    SYSCTL_CPUSEL12_CMPSS    = 0xCU,
    //! Configure CPU Select for DCC
    SYSCTL_CPUSEL13_DCC      = 0xDU,
    //! Configure CPU Select for DAC
    SYSCTL_CPUSEL14_DAC      = 0xEU,
    //! Configure CPU Select for CLB
    SYSCTL_CPUSEL15_CLB      = 0xFU,
    //! Configure CPU Select for FSI
    SYSCTL_CPUSEL16_FSI      = 0x10U,
    //! Configure CPU Select for LIN
    SYSCTL_CPUSEL17_LIN      = 0x11U,
    //! Configure CPU Select for ETHERCAT
    SYSCTL_CPUSEL23_ECAT     = 0x17U,
    //! Configure CPU Select for HRCAL
    SYSCTL_CPUSEL25_HRCAL    = 0x19U,
    //! Configure CPU Select for AES
    SYSCTL_CPUSEL26_AES      = 0x1AU,
    //! Configure CPU Select for EPG
    SYSCTL_CPUSEL27_EPG      = 0x1BU,
} SysCtl_CPUSelPeripheral;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectCPUForPeripheralInstance() as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CPUSEL_EPWM1 = 0x0000,
    SYSCTL_CPUSEL_EPWM2 = 0x0100,
    SYSCTL_CPUSEL_EPWM3 = 0x0200,
    SYSCTL_CPUSEL_EPWM4 = 0x0300,
    SYSCTL_CPUSEL_EPWM5 = 0x0400,
    SYSCTL_CPUSEL_EPWM6 = 0x0500,
    SYSCTL_CPUSEL_EPWM7 = 0x0600,
    SYSCTL_CPUSEL_EPWM8 = 0x0700,
    SYSCTL_CPUSEL_EPWM9 = 0x0800,
    SYSCTL_CPUSEL_EPWM10 = 0x0900,
    SYSCTL_CPUSEL_EPWM11 = 0x0A00,
    SYSCTL_CPUSEL_EPWM12 = 0x0B00,
    SYSCTL_CPUSEL_EPWM13 = 0x0C00,
    SYSCTL_CPUSEL_EPWM14 = 0x0D00,
    SYSCTL_CPUSEL_EPWM15 = 0x0E00,
    SYSCTL_CPUSEL_EPWM16 = 0x0F00,
    SYSCTL_CPUSEL_EPWM17 = 0x1000,
    SYSCTL_CPUSEL_EPWM18 = 0x1100,
    SYSCTL_CPUSEL_ECAP1 = 0x0001,
    SYSCTL_CPUSEL_ECAP2 = 0x0101,
    SYSCTL_CPUSEL_ECAP3 = 0x0201,
    SYSCTL_CPUSEL_ECAP4 = 0x0301,
    SYSCTL_CPUSEL_ECAP5 = 0x0401,
    SYSCTL_CPUSEL_ECAP6 = 0x0501,
    SYSCTL_CPUSEL_ECAP7 = 0x0601,
    SYSCTL_CPUSEL_EQEP1 = 0x0002,
    SYSCTL_CPUSEL_EQEP2 = 0x0102,
    SYSCTL_CPUSEL_EQEP3 = 0x0202,
    SYSCTL_CPUSEL_EQEP4 = 0x0302,
    SYSCTL_CPUSEL_EQEP5 = 0x0402,
    SYSCTL_CPUSEL_EQEP6 = 0x0502,
    SYSCTL_CPUSEL_HRCAP6 = 0x0503,
    SYSCTL_CPUSEL_HRCAP7 = 0x0603,
    SYSCTL_CPUSEL_SD1 = 0x0004,
    SYSCTL_CPUSEL_SD2 = 0x0104,
    SYSCTL_CPUSEL_SD3 = 0x0204,
    SYSCTL_CPUSEL_SD4 = 0x0304,
    SYSCTL_CPUSEL_SCIA = 0x0005,
    SYSCTL_CPUSEL_SCIB = 0x0105,
    SYSCTL_CPUSEL_UARTA = 0x1005,
    SYSCTL_CPUSEL_UARTB = 0x1105,
    SYSCTL_CPUSEL_SPIA = 0x0006,
    SYSCTL_CPUSEL_SPIB = 0x0106,
    SYSCTL_CPUSEL_SPIC = 0x0206,
    SYSCTL_CPUSEL_SPID = 0x0306,
    SYSCTL_CPUSEL_I2CA = 0x0007,
    SYSCTL_CPUSEL_I2CB = 0x0107,
    SYSCTL_CPUSEL_PMBUSA = 0x1007,
    SYSCTL_CPUSEL_CANA = 0x0008,
    SYSCTL_CPUSEL_MCANA = 0x0408,
    SYSCTL_CPUSEL_MCANB = 0x0508,
    SYSCTL_CPUSEL_USBA = 0x1009,
    SYSCTL_CPUSEL_ADCA = 0x000B,
    SYSCTL_CPUSEL_ADCB = 0x010B,
    SYSCTL_CPUSEL_ADCC = 0x020B,
    SYSCTL_CPUSEL_CMPSS1 = 0x000C,
    SYSCTL_CPUSEL_CMPSS2 = 0x010C,
    SYSCTL_CPUSEL_CMPSS3 = 0x020C,
    SYSCTL_CPUSEL_CMPSS4 = 0x030C,
    SYSCTL_CPUSEL_CMPSS5 = 0x040C,
    SYSCTL_CPUSEL_CMPSS6 = 0x050C,
    SYSCTL_CPUSEL_CMPSS7 = 0x060C,
    SYSCTL_CPUSEL_CMPSS8 = 0x070C,
    SYSCTL_CPUSEL_CMPSS9 = 0x080C,
    SYSCTL_CPUSEL_CMPSS10 = 0x090C,
    SYSCTL_CPUSEL_CMPSS11 = 0x0A0C,
    SYSCTL_CPUSEL_DCC0 = 0x000D,
    SYSCTL_CPUSEL_DCC1 = 0x010D,
    SYSCTL_CPUSEL_DCC2 = 0x020D,
    SYSCTL_CPUSEL_DACA = 0x100E,
    SYSCTL_CPUSEL_DACC = 0x120E,
    SYSCTL_CPUSEL_CLB1 = 0x000F,
    SYSCTL_CPUSEL_CLB2 = 0x010F,
    SYSCTL_CPUSEL_CLB3 = 0x020F,
    SYSCTL_CPUSEL_CLB4 = 0x030F,
    SYSCTL_CPUSEL_CLB5 = 0x040F,
    SYSCTL_CPUSEL_CLB6 = 0x050F,
    SYSCTL_CPUSEL_FSITXA = 0x0010,
    SYSCTL_CPUSEL_FSITXB = 0x0110,
    SYSCTL_CPUSEL_FSIRXA = 0x1010,
    SYSCTL_CPUSEL_FSIRXB = 0x1110,
    SYSCTL_CPUSEL_FSIRXC = 0x1210,
    SYSCTL_CPUSEL_FSIRXD = 0x1310,
    SYSCTL_CPUSEL_LINA = 0x0011,
    SYSCTL_CPUSEL_LINB = 0x0111,
    SYSCTL_CPUSEL_ECAT = 0x0017,
    SYSCTL_CPUSEL_HRCAL0 = 0x0019,
    SYSCTL_CPUSEL_HRCAL1 = 0x0119,
    SYSCTL_CPUSEL_HRCAL2 = 0x0219,
    SYSCTL_CPUSEL_AESA = 0x001A,
    SYSCTL_CPUSEL_EPG1 = 0x001B,
    SYSCTL_CPUSEL_ADCCHECKER1 = 0x001C,
    SYSCTL_CPUSEL_ADCCHECKER2 = 0x011C,
    SYSCTL_CPUSEL_ADCCHECKER3 = 0x021C,
    SYSCTL_CPUSEL_ADCCHECKER4 = 0x031C,
    SYSCTL_CPUSEL_ADCCHECKER5 = 0x041C,
    SYSCTL_CPUSEL_ADCCHECKER6 = 0x051C,
    SYSCTL_CPUSEL_ADCCHECKER7 = 0x061C,
    SYSCTL_CPUSEL_ADCCHECKER8 = 0x071C
} SysCtl_CPUSelPeriphInstance;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectCPUForPeripheral() as \e cpuInst parameter.
//
//*****************************************************************************
typedef enum
{
    //! Connect the peripheral (indicated by SysCtl_CPUSelPeripheral) to CPU1
    SYSCTL_CPUSEL_CPU1 = 0x0U,
    //! Connect the peripheral (indicated by SysCtl_CPUSelPeripheral) to CPU2
    SYSCTL_CPUSEL_CPU2 = 0x1U
} SysCtl_CPUSel;

