TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/sysctl.h
#ifdef CPU2
//*****************************************************************************
//
//! Enables lock-step mode.
//!
//! This function enables lockstep mode for CPU.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_enableLockStep(void)
{
    EALLOW;

    //
    // Enable lockstep
    //
    HWREG(CPUSYS_BASE + SYSCTL_O_LSEN) = 1U;

    EDIS;
}

//*****************************************************************************
//
//! Disables lock-step mode.
//!
//! This function disables lockstep mode for CPU.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_disableLockStep(void)
{
    EALLOW;

    //
    // Enable lockstep
    //
    HWREG(CPUSYS_BASE + SYSCTL_O_LSEN) = 0U;

    EDIS;
}

//*****************************************************************************
//
//! Get LCM error flags.
//!
//! This function returns the error flags from LCM (Lock Step Compare) module
//!
//! \return LCM error flags
//! The values can be one/ more from:
//! - SYSCTL_LCM_ERR_FLG_GERR : Global error event flag
//! - SYSCTL_LCM_ERR_FLG_CPU  : CPU1 Lockstep miscompare flag
//
//*****************************************************************************
static inline uint32_t
SysCtl_getLCMErrorFlag(void)
{
    return(HWREG(SYSSTAT_BASE + SYSCTL_O_LCM_ERR_FLG));
}

//*****************************************************************************
//
//! Clear LCM error flags.
//!
//! \param flags is the flags to be cleared. The value can be OR of :
//! - SYSCTL_LCM_ERR_FLG_GERR : Global error event flag
//! - SYSCTL_LCM_ERR_FLG_CPU  : CPU1 Lockstep miscompare flag
//!
//! This function clears the selected error flags from LCM (Lock Step Compare)
//! module.
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_clearLCMErrorFlag(uint32_t flags)
{
    ASSERT((flags & ~(SYSCTL_LCM_ERR_FLG_GERR | SYSCTL_LCM_ERR_FLG_CPU)) == 0U);
    HWREG(SYSSTAT_BASE + SYSCTL_O_LCM_ERR_FLG_CLR) = flags;
}

//*****************************************************************************
//
//! Set LCM error flags.
//!
//! \param flags is the flags to be set. The value can be following:
//! - SYSCTL_LCM_ERR_FLG_CPU : CPU1 Lockstep miscompare flag
//!
//! This function sets the selected error flags from LCM (Lock Step Compare)
//! module.
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_setLCMErrorFlag(uint32_t flags)
{
    ASSERT(flags == SYSCTL_LCM_ERR_FLG_CPU);
    EALLOW;
    HWREG(SYSSTAT_BASE + SYSCTL_O_LCM_ERR_FLG_SET) =
                    flags |  (0xA5UL << SYSCTL_LCM_ERR_FLG_SET_KEY_S);
    EDIS;
}

//*****************************************************************************
//
//! Get Register Parity Error flags.
//!
//! This function returns the Register Parity Error flags.
//!
//! \return Register Parity Error flags
//! The values can be one/ more from:
//! - SYSCTL_REGPARITY_ERR_FLG_GERR : Global error event flag
//! - SYSCTL_REGPARITY_ERR_FLG_CPU : Register parity error from CPU LCM
//
//*****************************************************************************
static inline uint32_t
SysCtl_getRegParityErrorFlag(void)
{
    return(HWREG(SYSSTAT_BASE + SYSCTL_O_REGPARITY_ERR_FLG));
}

//*****************************************************************************
//
//! Clear Register Parity Error flags.
//!
//! \param flags is the flags to be cleared. The value can be OR of :
//! - SYSCTL_REGPARITY_ERR_FLG_GERR : Global error event flag
//! - SYSCTL_REGPARITY_ERR_FLG_CPU : Register parity error from CPU LCM
//!
//! This function clears the selected Register Parity Error flags.
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_clearRegParityErrorFlag(uint32_t flags)
{
    ASSERT((flags & ~(SYSCTL_REGPARITY_ERR_FLG_GERR |
                      SYSCTL_REGPARITY_ERR_FLG_CPU)) == 0U);
    HWREG(SYSSTAT_BASE + SYSCTL_O_REGPARITY_ERR_FLG_CLR) = flags;
}

//*****************************************************************************
//
//! Set Register Parity Error flags.
//!
//! \param flags is the flags to be set. The value can be following:
//! - SYSCTL_REGPARITY_ERR_FLG_CPU : Register parity error from LCM
//!
//! This function sets the selected Register Parity Error flags.
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_setRegParityErrorFlag(uint32_t flags)
{
    ASSERT(flags == SYSCTL_REGPARITY_ERR_FLG_CPU);
    EALLOW;
    HWREG(SYSSTAT_BASE + SYSCTL_O_REGPARITY_ERR_FLG_SET) =
                    flags |  (0xA5UL << SYSCTL_LCM_ERR_FLG_SET_KEY_S);
    EDIS;
}
#endif

//*****************************************************************************
//
//! Sets the LFU_CPU configuration
//!
//! \param value is the value to be set.
//!     - 0 : No pending requests
//!     - 1 : LFU Request in progress
//!
//! \note This bit is used by compiler/application code for implementing CPU LFU
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_setLFUCPU(uint16_t value)
{
    EALLOW;
    ASSERT (value <= 1U);
    if(value == 0U)
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &= ~SYSCTL_LFUCONFIG_LFU_CPU;
    }
    else
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) |= SYSCTL_LFUCONFIG_LFU_CPU;
    }
    EDIS;
}

//*****************************************************************************
//
//! Gets the LFU_CPU configuration
//!
//! \note This bit is used by compiler/application code for implementing CPU LFU
//!
//! \return 0 if No pending requests, 1 if LFU Request is in progress
//
//*****************************************************************************
static inline uint16_t
SysCtl_getLFUCPU(void)
{
    return(((HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &
             SYSCTL_LFUCONFIG_LFU_CPU) == 0U) ? 0U : 1U);
}

//*****************************************************************************
//
//! Sets the LFU_CLA configuration
//!
//! \param value is the value to be set.
//!     - 0 : No pending requests
//!     - 1 : LFU Request in progress
//!
//! \note This bit is used by compiler/application code for implementing CLA LFU
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_setLFUCLA1(uint16_t value)
{
    EALLOW;
    ASSERT (value <= 1U);
    if(value == 0U)
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &= ~SYSCTL_LFUCONFIG_LFU_CLA1;
    }
    else
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) |= SYSCTL_LFUCONFIG_LFU_CLA1;
    }
    EDIS;
}

//*****************************************************************************
//
//! Gets the LFU_CLA configuration
//!
//! \note This bit is used by compiler/application code for implementing CLA LFU
//!
//! \return 0 if No pending requests, 1 if LFU Request is in progress
//
//*****************************************************************************
static inline uint16_t
SysCtl_getLFUCLA1(void)
{
    return(((HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &
             SYSCTL_LFUCONFIG_LFU_CLA1) == 0U) ? 0U : 1U);
}

//*****************************************************************************
//
//! Swap PIE Vector Table to alternate location and swap LS0 and LS1
//!
//! \param swap Whether to enable or disable swap
//!         - true  : PIE Vector Table is swapped to alternate location.
//!                   LS0 and LS1 is swapped
//!         - false : PIE vector table is mapped to the original location
//!                   LS0 and LS1 is mapped to original location
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_swapPieVectorAndLS01(bool swap)
{
    EALLOW;
    if(swap)
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) |=
                (SYSCTL_LFUCONFIG_PIEVECTORSWAP | SYSCTL_LFUCONFIG_LS01SWAP);
    }
    else
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &=
                ~(SYSCTL_LFUCONFIG_PIEVECTORSWAP | SYSCTL_LFUCONFIG_LS01SWAP);
    }
    EDIS;
}

//*****************************************************************************
//
//! Swap PIE Vector Table to alternate location
//!
//! \param swap Whether to enable or disable swap
//!         - true  : PIE Vector Table is swapped to alternate location
//!         - false : PIE vector table is mapped to the original location
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_swapPieVector(bool swap)
{
    EALLOW;
    if(swap)
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) |= SYSCTL_LFUCONFIG_PIEVECTORSWAP;
    }
    else
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &= ~SYSCTL_LFUCONFIG_PIEVECTORSWAP;
    }
    EDIS;
}

//*****************************************************************************
//
//! Checks if the PIE Vector Table is swapped or not
//!
//! \param reg is the register to be set
//! \param value is the value to be set
//! \return true if the PIE Vector Table is mapped to original location,
//!         false if PIE Vector Table is swapped to alternate location
//
//*****************************************************************************
static inline bool
SysCtl_isPieVectorSwap(void)
{
    return((HWREG(LFU_BASE + SYSCTL_O_LFUSTATUS) &
            SYSCTL_LFUSTATUS_PIEVECTORSWAP) != 0U);
}

//*****************************************************************************
//
//! Swap LS0 and LS1
//!
//! \param swap Whether to enable or disable swap
//!         - true  : LS0 and LS1 is swapped
//!         - false : LS0 and LS1 is mapped to original location
//!
//! \return None
//
//*****************************************************************************
static inline void
SysCtl_swapLS01(bool swap )
{
    EALLOW;
    if(swap)
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) |= SYSCTL_LFUCONFIG_LS01SWAP;
    }
    else
    {
        HWREG(LFU_BASE + SYSCTL_O_LFUCONFIG) &= ~SYSCTL_LFUCONFIG_LS01SWAP;
    }
    EDIS;
}

//*****************************************************************************
//
//! Checks if the LS0 and LS1 are swapped or not
//!
//! \param reg is the register to be set
//! \param value is the value to be set
//! \return true if the LS0 and LS1 is mapped to original location,
//!         false if LS0 and LS1 is swapped
//
//*****************************************************************************
static inline bool
SysCtl_isLS01Swap(void)
{
    return((HWREG(LFU_BASE + SYSCTL_O_LFUSTATUS) &
            SYSCTL_LFUSTATUS_LS01SWAP) != 0U);
}

//*****************************************************************************
//
//! Sets the user register.
//!
//! \param reg is the register to be set
//! \param value is the value to be set
//!
//! This function sets specified LFU user register.
//! The \e value parameter can have one enumerated value from
//! SysCtl_LFUUserRegister.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_setLFUUserRegister(SysCtl_LFUUserRegister reg, uint32_t value)
{
    EALLOW;
    HWREG(LFU_BASE + SYSCTL_O_SWCONFIG1_SYSRSN + ((uint32_t)reg * 2UL)) = value;
    EDIS;
}

//*****************************************************************************
//
//! Gets the user register.
//!
//! \param reg is the register to be set
//!
//! This function sets specified LFU user register.
//! The \e value parameter can have one enumerated value from
//! SysCtl_LFUUserRegister.
//!
//! \return value of the specified register.
//
//*****************************************************************************
static inline uint32_t
SysCtl_getLFUUserRegister(SysCtl_LFUUserRegister reg)
{
    return(HWREG(LFU_BASE + SYSCTL_O_SWCONFIG1_SYSRSN + ((uint32_t)reg * 2UL)));
}

//*****************************************************************************
//
//! Locks the LFUConfig register
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_lockLFUConfigRegister(void)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_LOCK) |= SYSCTL_LFU_LOCK_LFUCONFIG;
}

//*****************************************************************************
//
//! Locks the LFU User registers
//!
//! \param register to be locked
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_lockLFUUserRegister(SysCtl_LFUUserRegister reg)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_LOCK) |= 0x100UL << (uint32_t)reg;
}

//*****************************************************************************
//
//! Unlocks the LFUConfig register
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_unlockLFUConfigRegister(void)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_LOCK) &= ~SYSCTL_LFU_LOCK_LFUCONFIG;
}

//*****************************************************************************
//
//! Unlocks the LFU User registers
//!
//! \param register to be unlocked
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_unlockLFUUserRegister(SysCtl_LFUUserRegister reg)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_LOCK) &= ~(0x100UL << (uint32_t)reg);
}

//*****************************************************************************
//
//! Commits the LFUConfig register
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_commitLFUConfigRegister(void)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_COMMIT) |= SYSCTL_LFU_COMMIT_LFUCONFIG;
}

//*****************************************************************************
//
//! Commits the LFU User registers
//!
//! \param register to be committed
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_commitLFUUserRegister(SysCtl_LFUUserRegister reg)
{
    HWREG(LFU_BASE + SYSCTL_O_LFU_COMMIT) |= 0x100UL << (uint32_t)reg;
}

//*****************************************************************************
//
//! Allocates the Flash Bank to selected CPU
//!
//! \param flashBank is Flash bank to be configured (SYSCTL_FLASH_BANK0-4)
//! \param cpu is the CPU to be allocated to (SYSCTL_CPUSEL_CPU1/2)
//!
//! \note This function should be called from CPU1 only
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_allocateFlashBank(SysCtl_FlashBank flashBank, SysCtl_CPUSel cpu)
{
    uint32_t value = (cpu == SYSCTL_CPUSEL_CPU1) ? 0U : 3U;

    HWREG(DEVCFG_BASE + SYSCTL_O_BANKMUXSEL) =
        (HWREG(DEVCFG_BASE + SYSCTL_O_BANKMUXSEL) &
         ~(SYSCTL_BANKMUXSEL_BANK0_M << (uint16_t)flashBank)) |
        value << (uint32_t)flashBank;

